{
  "content": {
    "headerClass": "mainModule",
    "nodes": [
      {
        "img": "/images/cup_lux_main.png",
        "text": "",
        "class": "top"
      },
      {
        "img": "/images/roasting_coffee.png",
        "link": "{LINK||menu_link}"
      },
      {
        "img": "/images/location_hours.png",
        "link": "{LINK||location_hours_link}",
        "content": {
          "class": "show location-hours",
          "heading": "LOCATION HOURS",
          "details": [
            {
              "subHeading": "Test",
              "text": [
                "1",
                "2",
                "3"
              ]
            }
          ]
        }
      },
      {
        "img": "/images/bloc_card.png",
        "link": "{LINK||bloc_card_link}",
        "content": {
          "class": "hide bloc-card",
          "heading": "BLOC CARD",
          "details": [
            {
              "subHeading": "/bläk/ (block)",
              "text": [
                "a combination of people, parties, or groups sharing a common purpose."
              ]
            },
            {
              "subHeading": "What is it?",
              "text": [
                "The CupLux Bloc card is our version of a loyalty program.  With it you are showing your support for our Canopy Love campaign and as a reward you get 10% back on all purchases at CupLux to put towards future visits."
              ]
            },
            {
              "subHeading": "How Do I Join?",
              "text": [
                "You can sign-up online ahead of time and pick-up your card at the store, or you can just sign-up next time you stop by."
              ]
            },
            {
              "subHeading": "How does it work?",
              "text": [
                "Simple. You get 10% back on everything you buy at CupLux.  The running balance from those purchases is kept on your card, and you can use it whenver you want, for food or drink.  Easy Peasy."
              ]
            },
            {
              "subHeading": "Member Fee",
              "text": [
                "There is an annual $5.00 membership fee to join the Bloc.  We use the profits from this membership fee to drive our Canopy Love Campaign, which helps preserve and expand the tree canopy here in Charlotte.  Click here to learn more about Canopy Love."
              ]
            }
          ]
        }
      },
      {
        "img": "/images/canopy.png",
        "link": "{LINK||canopy_love_link}",
        "content": {
          "class": "hide canopy-love",
          "heading": "CANOPY LOVE",
          "details": [
            {
              "text": [
                "We love trees, almost as much as we love coffee.  Charlotte has one of the greatest tree canopies in the country.  This canopy makes our city more beautiful, keeps us cooler during the summer and provides a habitat for wildlife.  This canopy however, doesn't exist without a lot of  TLC (Tree Loving Care)!",
                "Our Canopy Love campaign uses profits we generate from selling Bloc Memberships to bolster local efforts to maintain and increase Charlotte's Tree Canopy.  By working closely with our expert partners at TreesCharlotte,  we'll plant new trees, take care of existing ones and help educate the public on what we all can do to keep our canopy beautiful."
              ]
            },
            {
              "subHeading": "Why?",
              "text": [
                "We believe its important for all businesses and residents to give back their communites in some way shape or form.  For us that means creating positive, visible impact through Canopy Love and other conservation related activities."
              ]
            },
            {
              "subHeading": "Partners",
              "text": [
                "TreesCharlotte Logo, Catawba Land Conservancy Logo, Etc"
              ]
            }
          ]
        }
      },
      {
        "img": "",
        "link": "{LINK||about_link}",
        "content": {
          "class": "hide about",
          "details": [
            {
              "subHeading": "Drive-Up Coffee",
              "text": [
                "CupLux is a start-up coffee company opening its doors in February 2017.  We are proud to be a part of the burgeoning coffee scene here in Charlotte and hope to become the city's favorite drive-up coffee shop.  We offer a variety of coffees and coffee drinks from Stumptown Coffee Roasters and local, North Carolina roasters.  And if you are in the mood for some food, we have a rotating selection of fresh baked bisquits and delicious spreads."
              ]
            },
            {
              "subHeading": "Experience",
              "text": [
                "Besides providing coffees that are on-par with your favorite sit down shop, we work hard to bring you the best patron experience.  When you stop by, expect not only specialty level coffee, but service that sets the bar high.  Our baristas are courteous, knowledgeable and passionate about what they do.  So if you are intrigued about what's going on in coffee both in Charlotte and abroad - ask away - we loving dropping knowledge and talking coffee."
              ]
            },
            {
              "subHeading": "Our Coffee",
              "text": [
                "Coffee today is no longer just a cup o' joe.  Much like wine, coffees from different regions or varietals have distinct flavors and characteristics. Our coffee roasters work hard to highlight these qualities.   Once the roasted coffee arrives at our shop, we follow through with the entire process of farm to cup, by brewing coffees to the standards set by the Specialty Coffee Association of America.  What this means for you is a cup of coffee that is never sour or bitter - but just right. No more running to the sugar and cream station out of fear of a bad cup o' joe.  Ask your barista about specific coffees to help you decide which one is best for you."
              ]
            }
          ]
        }
      }
    ],
    "social": {
      "small": [
        "facebook",
        "twitter",
        "instagram"
      ]
    }
  },
  "LINKS": {
    "menu_link": {
      "id": "menu-link",
      "class": "links",
      "content": "MENU",
      "href": "#"
    },
    "location_hours_link": {
      "id": "location-hours-link",
      "class": "links",
      "content": "LOCATION AND HOURS",
      "href": "#locationhours",
      "data-destination": "location-hours"
    },
    "bloc_card_link": {
      "id": "bloc-card-link",
      "class": "links",
      "content": "BLOC CARD",
      "href": "#bloccard",
      "data-destination": "bloc-card"
    },
    "canopy_love_link": {
      "id": "canopy-love-link",
      "class": "links",
      "content": "CANOPY LOVE",
      "href": "#canpoylove",
      "data-destination": "canopy-love"
    },
    "about_link": {
      "id": "about-link",
      "class": "links",
      "content": "ABOUT",
      "href": "#about",
      "data-destination": "about"
    }
  }
}