{
  "content": [
    {
      "header": "What is it?",
      "paras": [
        "The Cuplux Bloc card is our version of a loyalty program.  With it you are showing your support for our #CanopyLove campaign and as a reward you get 10% back on all purchases at Cuplux to put towards future visits."
      ]
    },
    {
      "header": "How does this compare to other rewards programs?",
      "paras": [
        "Most rewards program usually require 10 drink purchases before you get one on the house.  Starbucks now requires you to spend over $60 before you qualify for free drink or food.  With our program, you get 10% back on all purchases to put towards food or drink purchases at Cuplux during future visits. "
      ]
    },
    {
      "header": "How Do I Join?",
      "paras": [
        "One of our baristas would be happy to sign-up the next time you come thru!"
      ]
    },
    {
      "header": "How does it work?",
      "paras": [
        "Simple. You get 10% back on everything you buy at Cuplux.  The running balance from those purchases is kept on your card, and you can use it whenver you want, for food or drink at Cuplux.  Easy Peasy."
      ]
    },
    {
      "header": "Member Fee",
      "paras": [
        "There is an annual $5.00 membership fee to join the Bloc.  The fee from this membership is used support efforts around our community philosophy of Nature for All."
      ]
    },
    {
      "header": "<span id='exclusions-restrictions-link'>Exclusions & Restrictions</span>",
      "rowClass": "exclusions-restrictions",
      "paras": [
        "By using the Bloc Card, you agree to the terms set forth by Cuplux.  You cannot use your Bloc Card balance on the purchase of brew equipment, gift cards or the replacement cost of a new card.  Your balance cannot be transferred to another account.  The balance expires 36 months after the purchase date.  Members are only allowed one card per person.  In the event you lose your card, you can have it replaced at the store for the cost of the card.    The 10% generated from a Bloc Card can only be put back on the same individual's card.  Cuplux reserves the right to exclude other purchases it deems necessary.  Balances on a card can only be used at Cuplux and cannot be exchanged for cash or credit of any other type. These terms are all subject to change."
      ]
    }
  ]
}